qiujun8023/esp32-rover-car/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash：根据你的模组调整（4MB / 8MB / 16MB）
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# CPU 频率
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# FreeRTOS tick 1ms
CONFIG_FREERTOS_HZ=1000

# 主任务栈
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8

# WebSocket 支持
CONFIG_HTTPD_WS_SUPPORT=y

# 关闭 brownout 检测，避免电机电流尖峰触发复位
CONFIG_ESP_BROWNOUT_DET=n
CONFIG_ESP_SYSTEM_BROWNOUT_INTR=n

# 分区：单 APP 大分区
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
